src/Enums/инкГруппыВычетовПоНДФЛ/инкГруппыВычетовПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкГруппыВычетовПоНДФЛ</name>
  <enumValues>
    <name>Стандартные</name>
  </enumValues>
  <enumValues>
    <name>СтандартныеНаДетей</name>
  </enumValues>
  <enumValues>
    <name>Имущественные</name>
  </enumValues>
  <enumValues>
    <name>Социальные</name>
  </enumValues>
  <enumValues>
    <name>СоциальныеПоУведомлениюНО</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкНДФЛСтавкиНалогообложенияРезидента/инкНДФЛСтавкиНалогообложенияРезидента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкНДФЛСтавкиНалогообложенияРезидента</name>
  <enumValues>
    <name>Ставка09</name>
  </enumValues>
  <enumValues>
    <name>Ставка13</name>
  </enumValues>
  <enumValues>
    <name>Ставка35</name>
  </enumValues>
  <enumValues>
    <name>Ставка30</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкСтатусыРезидентов/инкСтатусыРезидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСтатусыРезидентов</name>
  <enumValues>
    <name>Резидент</name>
  </enumValues>
  <enumValues>
    <name>Нерезидент</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/инкНалогСервер/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Стандартный вычет
//
// Параметры:
//  ГруппаВычета - Перечисление	 - Группа вычета
// 
// Возвращаемое значение:
//  Булево - Признак стандартного вычета 
//
Функция СтандартныйВычет(ГруппаВычета) Экспорт
	
	ПроверкаБулево = Ложь;
	
	Если (ГруппаВычета = Перечисления.инкГруппыВычетовПоНДФЛ.Стандартные) ИЛИ
		 (ГруппаВычета = Перечисления.инкГруппыВычетовПоНДФЛ.СтандартныеНаДетей) 		 
	Тогда
		ПроверкаБулево = Истина;
	КонецЕсли;
	
	Возврат ПроверкаБулево; 
	
КонецФункции

// Функция - Имущественный вычет
//
// Параметры:
//  ГруппаВычета - Перечисление	 - Группа вычета
// 
// Возвращаемое значение:
//   Булево - Признак имущественного вычета
//
Функция ИмущественныйВычет(ГруппаВычета) Экспорт
	
	ПроверкаБулево = Ложь;
	
	Если (ГруппаВычета = Перечисления.инкГруппыВычетовПоНДФЛ.Имущественные) 		 
	Тогда
		ПроверкаБулево = Истина;
	КонецЕсли;
	
	Возврат ПроверкаБулево; 
	
КонецФункции

// Функция - Налоговый вычет за исключением стандартных
//
// Параметры:
//  ГруппаВычета - Перечисление	 - Группа вычета
// 
// Возвращаемое значение:
//  Булево - Признак стандратного или имущественного вычета
//
Функция НалоговыйВычетЗаИсключениемСтандартных(ГруппаВычета) Экспорт
	
	ПроверкаБулево = Ложь;
	
	Если Не ИмущественныйВычет(ГруппаВычета) И
		 НЕ СтандартныйВычет(ГруппаВычета) 
	Тогда
		ПроверкаБулево = Истина;
	КонецЕсли;

	Возврат ПроверкаБулево; 
	
КонецФункции

// Функция - Получить массив групп стандартных вычетов
// 
// Возвращаемое значение:
//  Массив - Группы стандартных вычетов
//
Функция ПолучитьМассивГруппСтандартныхВычетов() Экспорт
	
	МассивГруппВычетов = Новый Массив;
	
	МассивГруппВычетов.Добавить(Перечисления.инкГруппыВычетовПоНДФЛ.Стандартные);
	МассивГруппВычетов.Добавить(Перечисления.инкГруппыВычетовПоНДФЛ.СтандартныеНаДетей);
	
	Возврат МассивГруппВычетов; 
	
КонецФункции

// Функция - Получить процент по налоговой ставке
//
// Параметры:
//  НалоговаяСтавка	 - Перечисление	 - Налоговая ставка
// 
// Возвращаемое значение:
//  Число - Коэффициент налоговой ставки
//
Функция ПолучитьПроцентПоНалоговойСтавке(НалоговаяСтавка) Экспорт
	
	чПроцент = 0;
	
	Если НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка13 Тогда
		чПроцент = 0.13;		
	ИначеЕсли НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка30 Тогда 
		чПроцент = 0.3;
	ИначеЕсли НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка35 Тогда   
		чПроцент = 0.35;
	ИначеЕсли НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка09 Тогда   
		чПроцент = 0.09;
	КонецЕсли;
	
	Возврат чПроцент;
	
КонецФункции

// Функция - Получить налоговую ставку по проценту
//
// Параметры:
//  Процент	 - Число	 - Коэффициент налоговой ставки
// 
// Возвращаемое значение:
//  Перечисление - Налоговая ставка
//
Функция ПолучитьНалоговуюСтавкуПоПроценту(Процент) Экспорт
	
	НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.ПустаяСсылка();
	
	Если Процент = 0.13 Тогда
		НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка13;
	ИначеЕсли Процент = 0.3 Тогда 
		НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка30;
	ИначеЕсли Процент = 0.35 Тогда   
		НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка35;
	КонецЕсли;
	
	Возврат НалоговаяСтавка;
	
КонецФункции

// Функция - Получить налоговую ставку сотрудника
//
// Параметры:
//  Сотрудник	 - Ссылка	 - Справочник "Сотрудники"
// 
// Возвращаемое значение:
//  Перечисление - Налоговая ставка
//
Функция ПолучитьНалоговуюСтавкуСотрудника(Сотрудник) Экспорт
	
	НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка13;
	
	Если Сотрудник.СтатусРезидента = Перечисления.инкСтатусыРезидентов.Нерезидент Тогда
		НалоговаяСтавка = Перечисления.инкНДФЛСтавкиНалогообложенияРезидента.Ставка30;
	КонецЕсли;
	
	Возврат НалоговаяСтавка;
	
КонецФункции

// Функция - Получить процент налога сотрудника
//
// Параметры:
//  Сотрудник	 - Ссылка	 - Справочник "Сотрудники"
// 
// Возвращаемое значение:
//  Перечисление - Налоговая ставка
//
Функция ПолучитьПроцентНалогаСотрудника(Сотрудник) Экспорт
	
	НалоговаяСтавка = ПолучитьНалоговуюСтавкуСотрудника(Сотрудник);
	Возврат ПолучитьПроцентПоНалоговойСтавке(НалоговаяСтавка);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
